//////////////////////////////////////////////
//
//文件名：student.cpp
//程序功能：Student类的成员函数
//作者：Pipi
//日期：2016.10.15
//
//////////////////////////////////////////////

#include <iostream>
#include <string.h>
#include <iomanip>

#include "student.h"

using namespace std;


/////////////////////////////////////////////
//构造函数
//函数功能：初始化宿舍、床位信息为空
//函数参数：无
//参数返回值：无
//
Student::Student()
{
    roomNumber=0;
    bedNumber=0;
}


/////////////////////////////////////////////
//get函数
//函数功能：获得学生姓名
//函数参数：无
//参数返回值：字符型指针，返回学生姓名的地址
//
char *Student::getname()
{return name;}


/////////////////////////////////////////////
//get函数
//函数功能：获得学生性别
//函数参数：无
//参数返回值：字符型，返回学生性别
//
char Student::getsex()
{return sex;}


/////////////////////////////////////////////
//get函数
//函数功能：获得学生学号
//函数参数：无
//参数返回值：整型,返回学生学号
//
int Student::getnumber()
{return number;}


/////////////////////////////////////////////
//get函数
//函数功能：获得学生电话号码
//函数参数：无
//参数返回值：字符型指针,返回学生电话号码的地址
//
char *Student::getphone()
{return phone;}


/////////////////////////////////////////////
//get函数
//函数功能：获得学生宿舍号
//函数参数：无
//参数返回值：整型,返回学生宿舍号
//
int Student::getroomNumber()
{return roomNumber;}


/////////////////////////////////////////////
//get函数
//函数功能：获得学生床位号
//函数参数：无
//参数返回值：整型,返回学生床位号
//
int Student::getbedNumber()
{return bedNumber;}


/////////////////////////////////////////////
//get函数
//函数功能：获得学生入宿状态
//函数参数：无
//参数返回值：布尔型，0：离宿状态 1：入宿状态
//
bool Student::getmark()
{return mark;}


/////////////////////////////////////////////
//get函数
//函数功能：获得学生删除标记
//函数参数：无
//参数返回值：布尔型，0：已删 1：未删
//
bool Student::getnote()
{return note;}


/////////////////////////////////////////////
//添加函数
//函数功能：加入新学生，登记信息，将删除标记记为1，表示未删
//函数参数：字符型指针、字符型，整型。分别代表学生各类信息
//参数返回值：无
//
void Student::addstudent(char *na,char s,int num,char *ph)
{
    strcpy(name,na);
    sex=s;
    number=num;
    strcpy(phone,ph);
    note=1;             //删除标记（0：已删 1：未删）
}


/////////////////////////////////////////////
//set函数
//函数功能：设置姓名
//函数参数：字符型指针，学生姓名
//参数返回值：无
//
void Student::setname(char *na)
{strcpy(name,na);}


/////////////////////////////////////////////
//set函数
//函数功能：设置电话号码
//函数参数：字符型指针，学生电话号码
//参数返回值：无
//
void Student::setphone(char *ph)
{strcpy(phone,ph);}


/////////////////////////////////////////////
//set函数
//函数功能：设置性别
//函数参数：字符型，学生性别
//参数返回值：无
//
void Student::setsex(char s)
{sex=s;}


/////////////////////////////////////////////
//删除函数
//函数功能：删除学生，note=0代表学生被删除
//函数参数：无
//参数返回值：无
//
void Student::delstudent()
{note=0;}


/////////////////////////////////////////////
//show函数
//函数功能：展示学生信息
//函数参数：无
//参数返回值：无
//
void Student::show()
{
    cout<<"\n姓名："<<name<<endl;
    cout<<"性别：";
    if(sex=='f')cout<<"女"<<endl;
    else cout<<"男"<<endl;
    cout<<"学号："<<number<<endl;
    cout<<"电话号码："<<phone<<endl;
    cout<<"宿舍号："<<roomNumber<<endl;
    cout<<"床位号："<<bedNumber<<endl;
    cout<<"入宿状态：";
    if(mark==0)cout<<"尚未入宿"<<endl;
    else cout<<"已入宿"<<endl;
}


/////////////////////////////////////////////
//set函数
//函数功能：设置宿舍号和床位号
//函数参数：整型，宿舍号room和床位号bed
//参数返回值：无
//
void Student::setroom_bed(int room,int bed)
{
    roomNumber=room;
    bedNumber=bed;
}


/////////////////////////////////////////////
//入宿函数
//函数功能：入宿，0：离宿状态 1：入宿状态
//函数参数：无
//参数返回值：无
//
void Student::live()
{mark=1;}


/////////////////////////////////////////////
//退宿函数
//函数功能：退宿，0：离宿状态 1：入宿状态
//函数参数：无
//参数返回值：无
//
void Student::leave()
{mark=0;}
